raw_data/sysbench_4mcs/prepare.out
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 48
Random number generator seed is 0 and will be ignored


Threads started!

thread prepare20thread prepare24thread prepare15
thread prepare34
thread prepare3
Creating table 'sbtest35'...

Creating table 'sbtest16'...
thread prepare33
thread prepare7
Creating table 'sbtest4'...
thread prepare32
Creating table 'sbtest21'...
Creating table 'sbtest8'...
Creating table 'sbtest34'...
Creating table 'sbtest33'...

Creating table 'sbtest25'...
thread prepare41
Creating table 'sbtest42'...
thread prepare19
Creating table 'sbtest20'...
thread prepare27
Creating table 'sbtest28'...
thread prepare4
Creating table 'sbtest5'...
thread prepare22
Creating table 'sbtest23'...
thread prepare12
Creating table 'sbtest13'...
thread prepare18
Creating table 'sbtest19'...
thread prepare38
Creating table 'sbtest39'...
thread prepare23
Creating table 'sbtest24'...
thread prepare25
Creating table 'sbtest26'...
thread prepare13
Creating table 'sbtest14'...
thread prepare40
Creating table 'sbtest41'...
thread prepare46
Creating table 'sbtest47'...
thread prepare28
Creating table 'sbtest29'...
thread prepare26
Creating table 'sbtest27'...
thread prepare43
Creating table 'sbtest44'...
thread prepare45
Creating table 'sbtest46'...
thread prepare14
Creating table 'sbtest15'...
thread prepare36
Creating table 'sbtest37'...
thread prepare29
Creating table 'sbtest30'...
thread prepare8
Creating table 'sbtest9'...
thread prepare31
Creating table 'sbtest32'...
thread prepare9
Creating table 'sbtest10'...
thread prepare11
Creating table 'sbtest12'...
thread prepare39
Creating table 'sbtest40'...
thread prepare42
Creating table 'sbtest43'...
thread prepare21
Creating table 'sbtest22'...
thread prepare16
Creating table 'sbtest17'...
thread prepare5
Creating table 'sbtest6'...
thread prepare2
Creating table 'sbtest3'...
thread prepare30
Creating table 'sbtest31'...
thread prepare35
Creating table 'sbtest36'...
thread prepare6
Creating table 'sbtest7'...
thread prepare37
Creating table 'sbtest38'...
thread prepare44
Creating table 'sbtest45'...
thread prepare10
Creating table 'sbtest11'...
thread prepare47
Creating table 'sbtest48'...
Inserting 12000000 records into 'sbtest26'
Inserting 12000000 records into 'sbtest15'
Inserting 12000000 records into 'sbtest37'
Inserting 12000000 records into 'sbtest7'
Inserting 12000000 records into 'sbtest39'
Inserting 12000000 records into 'sbtest23'
Inserting 12000000 records into 'sbtest14'
Inserting 12000000 records into 'sbtest6'
Inserting 12000000 records into 'sbtest30'
Inserting 12000000 records into 'sbtest13'
Inserting 12000000 records into 'sbtest22'
Inserting 12000000 records into 'sbtest48'
Inserting 12000000 records into 'sbtest43'
Inserting 12000000 records into 'sbtest24'
Inserting 12000000 records into 'sbtest35'
Inserting 12000000 records into 'sbtest33'
Inserting 12000000 records into 'sbtest29'
Inserting 12000000 records into 'sbtest28'
Inserting 12000000 records into 'sbtest12'
Inserting 12000000 records into 'sbtest9'
Inserting 12000000 records into 'sbtest32'
Inserting 12000000 records into 'sbtest20'
Inserting 12000000 records into 'sbtest4'
Inserting 12000000 records into 'sbtest45'
Inserting 12000000 records into 'sbtest38'
Inserting 12000000 records into 'sbtest19'
Inserting 12000000 records into 'sbtest40'
Inserting 12000000 records into 'sbtest41'
Inserting 12000000 records into 'sbtest42'
Inserting 12000000 records into 'sbtest16'
Inserting 12000000 records into 'sbtest21'
Inserting 12000000 records into 'sbtest47'
Inserting 12000000 records into 'sbtest36'
Inserting 12000000 records into 'sbtest10'
Inserting 12000000 records into 'sbtest44'
Inserting 12000000 records into 'sbtest8'
Inserting 12000000 records into 'sbtest46'
Inserting 12000000 records into 'sbtest5'
Inserting 12000000 records into 'sbtest31'
Inserting 12000000 records into 'sbtest25'
Inserting 12000000 records into 'sbtest17'
Inserting 12000000 records into 'sbtest11'
Inserting 12000000 records into 'sbtest27'
Inserting 12000000 records into 'sbtest3'
Inserting 12000000 records into 'sbtest34'
thread prepare17
Creating table 'sbtest18'...
thread prepare0
Creating table 'sbtest1'...
thread prepare1
Creating table 'sbtest2'...
Inserting 12000000 records into 'sbtest2'Inserting 12000000 records into 'sbtest18'

Inserting 12000000 records into 'sbtest1'
Creating table 'sbtest86'...
Inserting 12000000 records into 'sbtest86'
Creating table 'sbtest51'...
Inserting 12000000 records into 'sbtest51'
Creating table 'sbtest72'...
Inserting 12000000 records into 'sbtest72'
Creating table 'sbtest77'...
Inserting 12000000 records into 'sbtest77'
Creating table 'sbtest60'...
Inserting 12000000 records into 'sbtest60'
Creating table 'sbtest55'...
Inserting 12000000 records into 'sbtest55'
Creating table 'sbtest89'...
Inserting 12000000 records into 'sbtest89'
Creating table 'sbtest78'...
Inserting 12000000 records into 'sbtest78'
Creating table 'sbtest91'...
Inserting 12000000 records into 'sbtest91'
Creating table 'sbtest84'...
Inserting 12000000 records into 'sbtest84'
Creating table 'sbtest94'...
Inserting 12000000 records into 'sbtest94'
Creating table 'sbtest59'...
Inserting 12000000 records into 'sbtest59'
Creating table 'sbtest87'...
Inserting 12000000 records into 'sbtest87'
Creating table 'sbtest93'...
Inserting 12000000 records into 'sbtest93'
Creating table 'sbtest49'...
Inserting 12000000 records into 'sbtest49'
Creating table 'sbtest54'...
Inserting 12000000 records into 'sbtest54'
Creating table 'sbtest92'...
Inserting 12000000 records into 'sbtest92'
Creating table 'sbtest75'...
Inserting 12000000 records into 'sbtest75'
Creating table 'sbtest74'...
Inserting 12000000 records into 'sbtest74'
Creating table 'sbtest68'...
Inserting 12000000 records into 'sbtest68'
Creating table 'sbtest69'...
Inserting 12000000 records into 'sbtest69'
Creating table 'sbtest81'...
Inserting 12000000 records into 'sbtest81'
Creating table 'sbtest56'...
Inserting 12000000 records into 'sbtest56'
Creating table 'sbtest63'...
Inserting 12000000 records into 'sbtest63'
Creating table 'sbtest82'...
Inserting 12000000 records into 'sbtest82'
Creating table 'sbtest85'...
Inserting 12000000 records into 'sbtest85'
Creating table 'sbtest62'...
Inserting 12000000 records into 'sbtest62'
Creating table 'sbtest57'...
Inserting 12000000 records into 'sbtest57'
Creating table 'sbtest61'...
Inserting 12000000 records into 'sbtest61'
Creating table 'sbtest52'...
Inserting 12000000 records into 'sbtest52'
Creating table 'sbtest53'...
Inserting 12000000 records into 'sbtest53'
Creating table 'sbtest67'...
Inserting 12000000 records into 'sbtest67'
Creating table 'sbtest70'...
Inserting 12000000 records into 'sbtest70'
Creating table 'sbtest90'...
Inserting 12000000 records into 'sbtest90'
Creating table 'sbtest65'...
Inserting 12000000 records into 'sbtest65'
Creating table 'sbtest66'...
Inserting 12000000 records into 'sbtest66'
Creating table 'sbtest73'...
Inserting 12000000 records into 'sbtest73'
Creating table 'sbtest58'...
Inserting 12000000 records into 'sbtest58'
Creating table 'sbtest88'...
Inserting 12000000 records into 'sbtest88'
Creating table 'sbtest64'...
Inserting 12000000 records into 'sbtest64'
Creating table 'sbtest79'...
Inserting 12000000 records into 'sbtest79'
Creating table 'sbtest76'...
Inserting 12000000 records into 'sbtest76'
Creating table 'sbtest80'...
Inserting 12000000 records into 'sbtest80'
Creating table 'sbtest83'...
Inserting 12000000 records into 'sbtest83'
Creating table 'sbtest95'...
Inserting 12000000 records into 'sbtest95'
Creating table 'sbtest71'...
Inserting 12000000 records into 'sbtest71'
Creating table 'sbtest50'...
Inserting 12000000 records into 'sbtest50'
Creating table 'sbtest96'...
Inserting 12000000 records into 'sbtest96'
OLTP test statistics:
    queries performed:
        read:                            0
        write:                           430848
        other:                           192
        total:                           431040
    transactions:                        0      (0.00 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 430848 (64.86 per sec.)
    other operations:                    192    (0.03 per sec.)

General statistics:
    total time:                          6642.4973s
    total number of events:              10000
    total time taken by event execution: 0.0040s
    response time:
         min:                                  0.00ms
         avg:                                  0.00ms
         max:                                  0.01ms
         approx.  95 percentile:               0.00ms

Threads fairness:
    events (avg/stddev):           208.3333/1428.26
    execution time (avg/stddev):   0.0001/0.00